Revit 2027 API
AlphanumericRevisionSettings.GetSequence Method
 Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetSequence()
Public Function GetSequence As IList(Of String)
public:
IList<String^>^ GetSequence()
member GetSequence : unit -> IList<string>
Return Value
IList<String>
See Also
Reference
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace